package eltex;

public class Main {
    public static void main(String[] args) {
        // для того чтобы выполнить задание для начала:
        /*
        * 1. считай все нужное из переменной args (где нужно преобразование типа, сделай преобразование типа, например строка -> число
        * 2. после считывания т.к. по заданию у тебя в качесвте аргументов тип объекта и количество таких объектов, то создаёшь либо переменную с типом интерфейса (т.к. у тебя и кофе и чай - потомки одного класса и реализуют один и тот же интерфейс), ну либо с типом абстрактного класса
        * 3. собственно далше по заданию.
        *
        * Пример как создавать переменную с типом интерфейса: ICrudAction myVariable = new Tea();
        * Или допустим тебе надо кофе - ICrudAction myVariable = new Coffe();
        * дальше ты уже можешь работать с переменной как с классом (обращаться к методам, полям и т.д.)
        *
        * По скрипту: для более лучшей читаемости, сделай парсинг(чтение) аргументов из переменной args в отдельной функции(опять же спроси меня, если совсем плохо и непонятно будет)
        * После считывания - реализовывай логику также в отдельной функции (не в main(т.к. задача main - войти в приложение, а не реализовать его логику))
        * */
    }
}
